; domain
; Title: FlowFree Domain for Edgy Strategy (made compatible with Fast Downward planners)
; Author: Aditi Basu (University of Melbourne)

(define (domain FlowFree)
    (:requirements :strips :typing :action-costs :conditional-effects)

    (:types
        dot node
    )

    (:predicates
        ; pre-strategy domain predicates
        (head ?n - node ?d - dot)
        (selected ?d - dot)
        (finished ?d - dot)
        (adjacent ?n - node ?n - node)
        (filled ?n - node ?d - dot)

        ; Planimation predicates
        (position ?n - node)
        
        ; Edgy strategy predicates
        (nextToEdge ?n - node)               ; is a node next to an edge?
        (currentPath ?n - node)        ; is a node part of the current path being formed?

        ; Fast-Downward predicates
        (pipe ?n - node)                  ; does a node contain a pipe?

    )

    ; cost function
    (:functions
        (total-cost) - number
    )

    ; move selection from d1 to d2 based on cost
    (:action select-colour
        :parameters     (?d1 - dot
                         ?d2 - dot)

        :precondition   (and 
                            (selected ?d1)
                            (not (selected ?d2))
                            (not (finished ?d2))
                        )

        :effect         (and 
                            (selected ?d2)
                            (not (selected ?d1))
                            (finished ?d1)              
				            
                            (increase (total-cost) 1)
                        )
    )
    
    ; move from n1 to n2 where n2 is NOT nextToEdge
    (:action move
        :parameters     (?n1 - node 
                         ?n2 - node 
                         ?d - dot)

        :precondition   (and 
                            (not (pipe ?n2))
                            (not (filled ?n2 ?d))
                            (selected ?d)
                            (head ?n1 ?d)
                            (not (head ?n2 ?d))
                            (adjacent ?n1 ?n2)
                            (not (nextToEdge ?n2))
                        )
                        
        :effect         (and 
                            (head ?n2 ?d)
                            (pipe ?n2)
                            (currentPath ?n2)
                             
                            ; increment cost as ?n2 is not nextToEdge
                            (increase (total-cost) 1)
                        )
    )
    
     ; move from n1 to n2 where n2 is nextToEdge
    (:action moveNextToEdge
        :parameters     (?n1 - node 
                         ?n2 - node 
                         ?d - dot)

        :precondition   (and 
                            (not (pipe ?n2))
                            (not (filled ?n2 ?d))
                            (selected ?d)
                            (head ?n1 ?d)
                            (not (head ?n2 ?d))
                            (adjacent ?n1 ?n2)
                            (nextToEdge ?n2)
                        )
        :effect         (and 
                            (head ?n2 ?d)
                            (pipe ?n2)
                            (currentPath ?n2)
                            
                            ; no cost increase as ?n2 is nextToEdge
                            (increase (total-cost) 0)
                        )
    )

    ; finish a path by connecting to second dot 
    (:action finishPath
        :parameters     (?n1 - node
                         ?n2 - node
                         ?d - dot)

        :precondition   (and
                            (filled ?n2 ?d) 
                            (selected ?d)
                            (head ?n1 ?d)
                            (not (head ?n2 ?d))
                            (adjacent ?n1 ?n2)
                        ) 

        :effect         (and 
                            (head ?n2 ?d)
                            
                            ; convert nodes adjacent to currentPath nodes to nextToEdge
                            (forall (?cp - node ?n - node) 
                                (when 
                                    (and (currentPath ?cp) (adjacent ?cp ?n))
                                    (nextToEdge ?n)    
                                )
                            )

                            ; reset all currentPath predicates to false 
                            (forall (?x - node)
                                (when 
                                    (currentPath ?x) 
                                    (not (currentPath ?x))
                                )
                            )

                            ; no cost increase as all dots will need to execute this action regardless of initial state
                            (increase (total-cost) 0)
                        )
    )
)

; problem
; Title: FlowFree Problem1-5x5 (Edgy Strategy)
; Author: Aditi Basu (University of Melbourne)

(define (problem FlowFree-5x5)
    (:domain FlowFree)
    (:objects 
        r y g b dummy - dot
        node1-5 node2-5 node3-5 node4-5 node5-5 - node
        node1-4 node2-4 node3-4 node4-4 node5-4 - node
        node1-3 node2-3 node3-3 node4-3 node5-3 - node
        node1-2 node2-2 node3-2 node4-2 node5-2 - node
        node1-1 node2-1 node3-1 node4-1 node5-1 - node
    )

    (:init
        ; head relations
        (head node1-5 r) (head node2-5 y)
        (head node2-4 g)
        (head node2-2 b) 

        ; filled relations
        ; the 'starting' positions
        (filled node1-5 r) (filled node2-5 y)
        (filled node2-4 g)
        (filled node2-2 b)
        ; the 'destinations'
        (filled node4-4 g) 
        (filled node2-3 y)
        (filled node5-2 b)
        (filled node5-1 r) 

        ; nextToEdge relations - outermost cells
        (nextToEdge node1-1) (nextToEdge node1-2) (nextToEdge node1-3) (nextToEdge node1-4) (nextToEdge node1-5)
        (nextToEdge node2-1)                                                                (nextToEdge node2-5)
        (nextToEdge node3-1)                                                                (nextToEdge node3-5)
        (nextToEdge node4-1)                                                                (nextToEdge node4-5)
        (nextToEdge node5-1) (nextToEdge node5-2) (nextToEdge node5-3) (nextToEdge node5-4) (nextToEdge node5-5)
        
        ; specify initial value of functions
        (= (total-cost) 0)

        ; select dummy dot
        (selected dummy)

        ; pipe relations
        (pipe node1-5) (pipe node2-5)
        (pipe node2-4)
        (pipe node2-2)
        (pipe node4-4) 
        (pipe node2-3)
        (pipe node5-2)
        (pipe node5-1) 

        ; adjacent relations
        (adjacent node1-1 node1-2) (adjacent node1-1 node2-1)
        (adjacent node1-2 node1-1) (adjacent node1-2 node2-2) (adjacent node1-2 node1-3)
        (adjacent node1-3 node1-2) (adjacent node1-3 node2-3) (adjacent node1-3 node1-4)
        (adjacent node1-4 node1-3) (adjacent node1-4 node2-4) (adjacent node1-4 node1-5)
        (adjacent node1-5 node1-4) (adjacent node1-5 node2-5)

        (adjacent node2-1 node1-1) (adjacent node2-1 node3-1) (adjacent node2-1 node2-2)
        (adjacent node2-2 node2-1) (adjacent node2-2 node2-3) (adjacent node2-2 node1-2) (adjacent node2-2 node3-2)
        (adjacent node2-3 node2-2) (adjacent node2-3 node2-4) (adjacent node2-3 node1-3) (adjacent node2-3 node3-3)
        (adjacent node2-4 node2-3) (adjacent node2-4 node2-5) (adjacent node2-4 node1-4) (adjacent node2-4 node3-4)
        (adjacent node2-5 node1-5) (adjacent node2-5 node3-5) (adjacent node2-5 node2-4)

        (adjacent node3-1 node2-1) (adjacent node3-1 node4-1) (adjacent node3-1 node3-2)
        (adjacent node3-2 node3-1) (adjacent node3-2 node3-3) (adjacent node3-2 node2-2) (adjacent node3-2 node4-2)
        (adjacent node3-3 node3-2) (adjacent node3-3 node3-4) (adjacent node3-3 node2-3) (adjacent node3-3 node4-3)
        (adjacent node3-4 node3-3) (adjacent node3-4 node3-5) (adjacent node3-4 node2-4) (adjacent node3-4 node4-4)
        (adjacent node3-5 node2-5) (adjacent node3-5 node4-5) (adjacent node3-5 node3-4)

        (adjacent node4-1 node3-1) (adjacent node4-1 node5-1) (adjacent node4-1 node4-2)
        (adjacent node4-2 node4-1) (adjacent node4-2 node4-3) (adjacent node4-2 node3-2) (adjacent node4-2 node5-2)
        (adjacent node4-3 node4-2) (adjacent node4-3 node4-4) (adjacent node4-3 node3-3) (adjacent node4-3 node5-3)
        (adjacent node4-4 node4-3) (adjacent node4-4 node4-5) (adjacent node4-4 node3-4) (adjacent node4-4 node5-4)
        (adjacent node4-5 node3-5) (adjacent node4-5 node5-5) (adjacent node4-5 node4-4)

        (adjacent node5-1 node5-2) (adjacent node5-1 node4-1)
        (adjacent node5-2 node5-1) (adjacent node5-2 node4-2) (adjacent node5-2 node5-3)
        (adjacent node5-3 node5-2) (adjacent node5-3 node4-3) (adjacent node5-3 node5-4)
        (adjacent node5-4 node5-3) (adjacent node5-4 node4-4) (adjacent node5-4 node5-5)
        (adjacent node5-5 node5-4) (adjacent node5-5 node4-5)

        ; position relations
        (position node1-1) (position node1-2) (position node1-3) (position node1-4) (position node1-5)
        (position node2-1) (position node2-2) (position node2-3) (position node2-4) (position node2-5)
        (position node3-1) (position node3-2) (position node3-3) (position node3-4) (position node3-5)
        (position node4-1) (position node4-2) (position node4-3) (position node4-4) (position node4-5)
        (position node5-1) (position node5-2) (position node5-3) (position node5-4) (position node5-5)

    )

    (:goal (and
        ;head relations
        (head node4-4 g) 
        (head node2-3 y)
        (head node5-2 b)
        (head node5-1 r)
        
        ; pipe relations
        (pipe node3-5) (pipe node4-5) (pipe node5-5)
        (pipe node1-4) (pipe node3-4) (pipe node5-4)
        (pipe node1-3) (pipe node3-3) (pipe node4-3) (pipe node5-3)
        (pipe node1-2) (pipe node3-2) (pipe node4-2)
        (pipe node1-1) (pipe node2-1) (pipe node3-1) (pipe node4-1)
        )
    )

    (:metric 
        minimize (total-cost)
    )

)

; plan
1. (select-colour dummy r)
   deleted: (selected dummy)
   added: (selected r) (finished dummy)
   goals met: 0 of 21
2. (movenexttoedge node1-5 node1-4 r)
   added: (head node1-4 r) (pipe node1-4) (currentpath node1-4)
   goals met: 1 of 21
3. (movenexttoedge node1-4 node1-3 r)
   added: (head node1-3 r) (pipe node1-3) (currentpath node1-3)
   goals met: 2 of 21
4. (movenexttoedge node1-3 node1-2 r)
   added: (head node1-2 r) (pipe node1-2) (currentpath node1-2)
   goals met: 3 of 21
5. (movenexttoedge node1-2 node1-1 r)
   added: (head node1-1 r) (pipe node1-1) (currentpath node1-1)
   goals met: 4 of 21
6. (movenexttoedge node1-1 node2-1 r)
   added: (head node2-1 r) (pipe node2-1) (currentpath node2-1)
   goals met: 5 of 21
7. (movenexttoedge node2-1 node3-1 r)
   added: (head node3-1 r) (pipe node3-1) (currentpath node3-1)
   goals met: 6 of 21
8. (movenexttoedge node3-1 node4-1 r)
   added: (head node4-1 r) (pipe node4-1) (currentpath node4-1)
   goals met: 7 of 21
9. (finishpath node4-1 node5-1 r)
   deleted: (currentpath node1-4) (currentpath node1-3) (currentpath node1-2) (currentpath node1-1) (currentpath node2-1) (currentpath node3-1) (currentpath node4-1)
   added: (head node5-1 r) (nexttoedge node2-4) (nexttoedge node2-3) (nexttoedge node2-2) (nexttoedge node3-2) (nexttoedge node4-2)
   goals met: 8 of 21
10. (select-colour r b)
   deleted: (selected r)
   added: (selected b) (finished r)
   goals met: 8 of 21
11. (movenexttoedge node2-2 node3-2 b)
   added: (head node3-2 b) (pipe node3-2) (currentpath node3-2)
   goals met: 9 of 21
12. (movenexttoedge node3-2 node4-2 b)
   added: (head node4-2 b) (pipe node4-2) (currentpath node4-2)
   goals met: 10 of 21
13. (finishpath node4-2 node5-2 b)
   deleted: (currentpath node3-2) (currentpath node4-2)
   added: (head node5-2 b) (nexttoedge node3-3) (nexttoedge node4-3)
   goals met: 11 of 21
14. (select-colour b y)
   deleted: (selected b)
   added: (selected y) (finished b)
   goals met: 11 of 21
15. (movenexttoedge node2-5 node3-5 y)
   added: (head node3-5 y) (pipe node3-5) (currentpath node3-5)
   goals met: 12 of 21
16. (movenexttoedge node3-5 node4-5 y)
   added: (head node4-5 y) (pipe node4-5) (currentpath node4-5)
   goals met: 13 of 21
17. (movenexttoedge node4-5 node5-5 y)
   added: (head node5-5 y) (pipe node5-5) (currentpath node5-5)
   goals met: 14 of 21
18. (movenexttoedge node5-5 node5-4 y)
   added: (head node5-4 y) (pipe node5-4) (currentpath node5-4)
   goals met: 15 of 21
19. (movenexttoedge node5-4 node5-3 y)
   added: (head node5-3 y) (pipe node5-3) (currentpath node5-3)
   goals met: 16 of 21
20. (movenexttoedge node5-3 node4-3 y)
   added: (head node4-3 y) (pipe node4-3) (currentpath node4-3)
   goals met: 17 of 21
21. (movenexttoedge node4-3 node3-3 y)
   added: (head node3-3 y) (pipe node3-3) (currentpath node3-3)
   goals met: 18 of 21
22. (finishpath node3-3 node2-3 y)
   deleted: (currentpath node3-5) (currentpath node4-5) (currentpath node5-5) (currentpath node5-4) (currentpath node3-3) (currentpath node4-3) (currentpath node5-3)
   added: (head node2-3 y) (nexttoedge node3-4) (nexttoedge node4-4)
   goals met: 19 of 21
23. (select-colour y g)
   deleted: (selected y)
   added: (selected g) (finished y)
   goals met: 19 of 21
24. (movenexttoedge node2-4 node3-4 g)
   added: (head node3-4 g) (pipe node3-4) (currentpath node3-4)
   goals met: 20 of 21
25. (finishpath node3-4 node4-4 g)
   deleted: (currentpath node3-4)
   added: (head node4-4 g)
   goals met: 21 of 21
